In [1]:
from datasets import load_dataset
import pandas as pd
import matplotlib.pyplot as plt

c:\Users\FAIZAN AKHTAR\anaconda3\envs\pthon_data_project\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
my_dataset=load_dataset('lukebarousse/data_jobs')

In [3]:
df=my_dataset['train'].to_pandas()

In [5]:
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

In [6]:
df['job_posted_date']

0        2023-06-16 13:44:15
1        2023-01-14 13:18:07
2        2023-10-10 13:14:55
3        2023-07-04 13:01:41
4        2023-08-07 14:29:36
                 ...
785736   2023-03-13 06:16:16
785737   2023-03-12 06:18:18
785738   2023-03-12 06:32:36
785739   2023-03-12 06:32:15
785740   2023-03-13 06:16:31
Name: job_posted_date, Length: 785741, dtype: datetime64[ns]

In [7]:
df.loc[:10, 'salary_year_avg': 'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [ ]:
median_salary_year=df['salary_year_avg'].median()
median_salary_hr=df['salary_hour_avg'].median()
median_salary_year
median_salary_hr

45.97999954223633

In [34]:
df_filled=df
df_filled['salary_hour_avg'].fillna(median_salary_hr, inplace=True)
df_filled['salary_year_avg'].fillna(median_salary_year, inplace=True)
df_filled.loc[:10, 'salary_year_avg': 'salary_hour_avg']

C:\Users\FAIZAN AKHTAR\AppData\Local\Temp\ipykernel_22520\96677983.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_filled['salary_hour_avg'].fillna(median_salary_hr, inplace=True)
C:\Users\FAIZAN AKHTAR\AppData\Local\Temp\ipykernel_22520\96677983.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_filled['salary_year_avg'].fillna(median_salary_year, inplace=True)

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [39]:
df_unique=df_filled
df_unique=df_unique.drop_duplicates()
print('length of original data', len(df_filled))
print('length of unique data', len(df_unique))
print('rows dropped', len(df_filled)-len(df_unique))

length of original data 785741
length of unique data 785640
rows dropped 101

In [41]:
df_unique=df_unique.drop_duplicates(subset=['job_title', 'company_name'])
print('length of original data', len(df_filled))
print('length of unique data', len(df_unique))
print('rows dropped', len(df_filled)-len(df_unique))

length of original data 785741
length of unique data 508042
rows dropped 277699